<?php

// +----------------------------------------------------------------------
// | 早安丿清晨
// +----------------------------------------------------------------------
// | 版权所有 2018~2022
// +----------------------------------------------------------------------
// | 官方网站: http://localhost
// +----------------------------------------------------------------------
// | YaBin:mail@lvyabin
// +----------------------------------------------------------------------
// | QQ:100839888
// +----------------------------------------------------------------------

/* 定义Session会话字段名 */
$session_name = 's' . substr(md5(__DIR__), -8);
$session_path = env('runtime_path') . 'sess' . DIRECTORY_SEPARATOR;
file_exists($session_path) || mkdir($session_path, 0755, true);

/* 定义Session会话参数 */
return [
    'id'             => '',
    'type'           => '',
    'prefix'         => 'tp',
    'auto_start'     => true,
    'path'           => $session_path,
    'name'           => $session_name,
    'var_session_id' => $session_name,
];